# 1초 동안 마이크로 소리강약을 체크하는 수를 h
# (헤르쯔, Hz 는 1초에 몇 번? 체크하는가를 의미한다.)
#
# 한 번 체크한 결과를 저장하는 비트 b
# (2비트를 사용하면 0 또는 1 두 가지, 16비트를 사용하면 65536가지..)
#
# 좌우 등 소리를 저장할 트랙 개수인 채널 c
# (모노는 1개, 스테레오는 2개의 트랙으로 저장함을 의미한다.)
#
# 녹음할 시간 s가 주어질 때,
#
# 필요한 저장 용량을 계산하는 프로그램을 작성해보자.
#
# 실제로 일반적인 CD 음질(44.1KHz, 16bit, 스테레오)로 1초 동안 저장하려면
# 44100 * 16 * 2 * 1 bit의 저장공간이 필요하다.
#
# 이렇게 녹음하는 방식을 PCM(Pulse Code Modulation) 방법이라고 하는데,
# 압축하지 않은 순수한(raw) 소리 데이터 파일은 대표적으로 *.wav 가 있다.
#
#
#    8 bit(비트)      = 1byte(바이트)     //       8bit=1Byte
# 1024 Byte(210 byte) = 1KB(킬로 바이트) // 1024bit=1KB
# 1024 KB(210 KB)     = 1MB(메가 바이트)
# 1024 MB(210 MB)     = 1GB(기가 바이트)
# 1024 GB(210 GB)     = 1TB(테라 바이트)

# 문제 이해가 잘 안갔는데, 그냥 bit 값을 MB로 변환을 해주면 되는 것이었다
h,b,c,s = map(int, input().split())
result = h*b*c*s / 8 / 1024 / 1024

print("%0.1f"%result, "MB", sep=" ")